app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "test image 2"], ["user_id", 1], ["created_at", "2019-10-26 19:53:56.681821"], ["updated_at", "2019-10-26 19:53:56.681821"], ["picture", "rails.png"]]